{
  "version": "https://jsonfeed.org/version/1",
  "title": "Anuar&#39;s blog",
  "home_page_url": "https://update-me.com",
  "feed_url": "https://update-me.com/feed/feed.json",
  "description": "Description of the website. Update me.",
  "author": {
    "name": "Author Name. Update me.",
    "url": ""
  },
  "items": [{
      "id": "https://update-me.com/blog/posts/spotter_blog_post/",
      "url": "https://update-me.com/blog/posts/spotter_blog_post/",
      "title": "Building Computer Vision System. Lessons in Technical Leadership.",
      "content_html": "<p><strong>Bottom Line Up Front:</strong> Built an AI-powered shooting target analysis system from scratch with zero computer vision background. The technical challenge taught me more about engineering leadership than any web project I'd shipped at scale companies.</p>\n<h2 id=\"the-challenge%3A-operating-in-uncharted-territory\">The Challenge: Operating in Uncharted Territory <a class=\"direct-link\" href=\"#the-challenge%3A-operating-in-uncharted-territory\">#</a></h2>\n<p>As a web engineer with 7 years at Uber, Headspace, and Aurora, I could have easily dismissed computer vision as &quot;not my domain.&quot; Instead, I saw an interesting problem: automatically detecting new bullet holes on shooting targets in real-time.</p>\n<p>The constraints were real—this needed to work with actual hardware in field conditions, not just clean datasets in Jupyter notebooks. I had to build everything: the data collection pipeline, annotation workflow, model training, and edge deployment on a Raspberry Pi 5.</p>\n<h2 id=\"initial-approach%3A-the-elegant-theory-trap\">Initial Approach: The Elegant Theory Trap <a class=\"direct-link\" href=\"#initial-approach%3A-the-elegant-theory-trap\">#</a></h2>\n<p>My first instinct was to frame this as a &quot;before/after comparison&quot; problem. Siamese neural networks seemed perfect—feed the model two images and let it learn to spot differences. The approach felt mathematically elegant.</p>\n<p>But after weeks of planning and initial development, I realized I was solving the wrong problem. Real shooting scenarios don't give you perfect &quot;before&quot; shots. Lighting changes, paper moves, and you need to work with whatever image you can capture.</p>\n<p><strong>Leadership Lesson #1:</strong> Resist the urge to force-fit elegant solutions. Match your technical approach to real-world constraints, not theoretical ideals.</p>\n<h2 id=\"the-pivot%3A-strategic-resource-allocation-over-pure-ml\">The Pivot: Strategic Resource Allocation Over Pure ML <a class=\"direct-link\" href=\"#the-pivot%3A-strategic-resource-allocation-over-pure-ml\">#</a></h2>\n<p>Here's where engineering leadership intersected with technical choices. I faced a classic fork-in-the-road decision:</p>\n<p><strong>Path 1:</strong> Collect significantly more training data and make the Siamese CNN approach work<br>\n<strong>Path 2:</strong> Pivot to a hybrid solution that leveraged existing data more efficiently</p>\n<p>Both were technically viable. But Path 1 required weeks of additional data collection with no guarantee of success—Siamese networks are notoriously data-hungry. Path 2 let me combine techniques intelligently and ship something that worked.</p>\n<p>I chose the hybrid approach:</p>\n<ol>\n<li><strong>YOLO for target localization</strong> - Detect target positions to remove background noise and focus on the relevant area</li>\n<li><strong>LightGlue for local feature matching</strong> - Align before/after images by finding corresponding keypoints, handling camera movement and paper shifts</li>\n<li><strong>Image comparison</strong> - Detect changes within the aligned, cropped target area</li>\n</ol>\n<p><strong>Leadership Lesson #2:</strong> When facing multiple viable technical paths, evaluate them on resource efficiency and risk, not just theoretical elegance. Sometimes the &quot;less pure&quot; ML solution is the better engineering solution.</p>\n<p><strong>Leadership Lesson #3:</strong> Sunk cost bias kills projects. When performance metrics show you're on the wrong path, pivot fast and learn faster.</p>\n<h2 id=\"the-80%2F20-reality-check\">The 80/20 Reality Check <a class=\"direct-link\" href=\"#the-80%2F20-reality-check\">#</a></h2>\n<p>Here's what actually consumed my time over those couple of months:</p>\n<ul>\n<li><strong>80% Data Engineering:</strong> Setting up hardware (Raspberry Pi + 64MP Arducam), building annotation pipelines with CVAT, handling coordinate system bugs, image resizing, format conversions</li>\n<li><strong>20% Model Architecture:</strong> The actual YOLO training and tuning</li>\n</ul>\n<p>This mirrors every complex system I've built in web development—the infrastructure and data architecture matter far more than the &quot;sexy&quot; algorithmic work.</p>\n<p>I spent days just getting the annotation coordinate system right. Original images were 2MB+ and crashed the training pipeline due to memory constraints. Had to resize everything to 640x640 and debug why my y-axis was inverted.</p>\n<p><strong>Leadership Lesson #4:</strong> Production systems are 80% plumbing, 20% algorithms. Plan accordingly.</p>\n<h2 id=\"modern-learning-velocity\">Modern Learning Velocity <a class=\"direct-link\" href=\"#modern-learning-velocity\">#</a></h2>\n<p>What struck me most was how different learning looks in 2025. I used LLMs to sanity-check architectural decisions, consumed Andrew Ng's courses for fundamentals, and leveraged papers/podcasts for cutting-edge techniques. The feedback loop between &quot;I have a question&quot; and &quot;I understand the solution space&quot; has compressed from weeks to hours.</p>\n<p>When I hit the coordinate system bug, I could iterate through solutions in real-time rather than waiting for Stack Overflow responses or diving through documentation.</p>\n<p><strong>Leadership Lesson #5:</strong> The tools for continuous learning have never been better. Use them as force multipliers, not crutches.</p>\n<h2 id=\"systems-thinking%3A-orchestrating-components\">Systems Thinking: Orchestrating Components <a class=\"direct-link\" href=\"#systems-thinking%3A-orchestrating-components\">#</a></h2>\n<p>The final solution wasn't a single model—it was an orchestrated pipeline:</p>\n<ul>\n<li><strong>YOLO for target detection and background removal</strong> - Precisely crop to the target area, eliminating environmental noise</li>\n<li><strong>LightGlue for local feature matching</strong> - Find corresponding keypoints between images to achieve robust alignment despite camera movement and paper positioning variations</li>\n<li><strong>Change detection</strong> - Compare aligned target areas to identify new holes</li>\n</ul>\n<p>This reinforced something I've seen across domains: production systems are about intelligent component orchestration, not single-technique optimization. The breakthrough came from combining multiple deep learning approaches (YOLO + LightGlue) with traditional change detection rather than forcing one technique.</p>\n<p><strong>Leadership Lesson #6:</strong> Success comes from systems thinking, not component optimization.</p>\n<h2 id=\"the-%22it-works!!!!%22-moment\">The &quot;It WORKS!!!!&quot; Moment <a class=\"direct-link\" href=\"#the-%22it-works!!!!%22-moment\">#</a></h2>\n<p>April 25th, 11 AM: After days of debugging annotation formats and coordinate systems, the model finally detected targets correctly. That moment of breakthrough—seeing the bounding boxes appear around bullet holes in test images—reminded me why I love building things that work in the real world.</p>\n<p>But more importantly, it validated the broader approach: when facing unfamiliar technical domains, the same engineering principles apply. Break down the problem, validate assumptions early, iterate based on data, and don't be afraid to pivot when the evidence points in a new direction.</p>\n<h2 id=\"broader-implications\">Broader Implications <a class=\"direct-link\" href=\"#broader-implications\">#</a></h2>\n<p>This project reinforced three patterns I've seen across every successful technical initiative:</p>\n<ol>\n<li>\n<p><strong>Front-load research before committing to implementation.</strong> The weeks I spent understanding the problem space saved months of building the wrong solution.</p>\n</li>\n<li>\n<p><strong>Data quality often trumps algorithmic sophistication.</strong> Clean, well-annotated datasets with proper coordinate systems matter more than hyperparameter tuning.</p>\n</li>\n<li>\n<p><strong>Real-world constraints drive architecture decisions more than theoretical elegance.</strong> Hardware limitations, memory constraints, and field conditions shaped every major technical choice.</p>\n</li>\n</ol>\n<p>These lessons apply whether you're building computer vision systems, distributed web services, or autonomous vehicle software. The domain changes, but the engineering leadership principles remain constant.</p>\n<h2 id=\"looking-forward\">Looking Forward <a class=\"direct-link\" href=\"#looking-forward\">#</a></h2>\n<p>This project scratched a personal itch while teaching me fundamentals that apply to any technical domain. It's a reminder that the best way to learn isn't always through courses or tutorials—sometimes you need to build something real, with real constraints, and real stakes.</p>\n<p>The spotter app now accurately detects new bullet holes in real-time. But the bigger win was proving to myself that with the right approach to problem-solving and continuous learning, any technical domain is learnable.</p>\n<hr>\n<p><em>Built over a couple of months while studying ML fundamentals. Sometimes the best classroom is your own curiosity plus a problem worth solving.</em></p>\n",
      "date_published": "2025-07-15T00:00:00+00:00"
    }
  ]
}
